piborisovich/microcontrollers/Milandr/Libraries/SPL/MDR32VF0xI/inc/MDR32VF0xI_timer.h
#define IS_TIMER_ETR_PRESCALER(VALUE) (((VALUE) == TIMER_ETR_PRESCALER_DIV_1) || \
                                       ((VALUE) == TIMER_ETR_PRESCALER_DIV_2) || \
                                       ((VALUE) == TIMER_ETR_PRESCALER_DIV_4) || \
                                       ((VALUE) == TIMER_ETR_PRESCALER_DIV_8))

/**
 * @brief TIMER ETR polarity configuration.
 */
typedef enum {
    TIMER_ETR_POLARITY_NON_INV = (((uint32_t)0x0) << TIMER_BRKETR_CNTRL_ETR_INV_Pos), /*!< ETR input is not inverted. */
    TIMER_ETR_POLARITY_INV     = (((uint32_t)0x1) << TIMER_BRKETR_CNTRL_ETR_INV_Pos)  /*!< ETR input is inverted. */
} TIMER_ETR_Polarity_TypeDef;

#define IS_TIMER_ETR_POLARITY(STATE) (((STATE) == TIMER_ETR_POLARITY_NON_INV) || \
                                      ((STATE) == TIMER_ETR_POLARITY_INV))

/**
 * @brief TIMER BRK polarity configuration.
 */
typedef enum {
    TIMER_BRK_POLARITY_NON_INV = (((uint32_t)0x0) << TIMER_BRKETR_CNTRL_BRK_INV_Pos), /*!< BRK input is not inverted. */
    TIMER_BRK_POLARITY_INV     = (((uint32_t)0x1) << TIMER_BRKETR_CNTRL_BRK_INV_Pos)  /*!< BRK input is inverted. */
} TIMER_BRK_Polarity_TypeDef;

#define IS_TIMER_BRK_POLARITY(STATE) (((STATE) == TIMER_BRK_POLARITY_NON_INV) || \
                                      ((STATE) == TIMER_BRK_POLARITY_INV))

/**
 * @brief TIMER channel number.
 */
typedef enum {
    TIMER_CH1 = ((uint32_t)0x0), /*!< Specify the TIMER channel 1. */
    TIMER_CH2 = ((uint32_t)0x1), /*!< Specify the TIMER channel 2. */
    TIMER_CH3 = ((uint32_t)0x2), /*!< Specify the TIMER channel 3. */
    TIMER_CH4 = ((uint32_t)0x3)  /*!< Specify the TIMER channel 4. */
} TIMER_CH_Number_TypeDef;

#define IS_TIMER_CH_NUMBER(NUMBER) (((NUMBER) == TIMER_CH1) || \
                                    ((NUMBER) == TIMER_CH2) || \
                                    ((NUMBER) == TIMER_CH3) || \
                                    ((NUMBER) == TIMER_CH4))

/**
 * @brief TIMER channel mode.
 */
typedef enum {
    TIMER_CH_MODE_PWM     = (((uint32_t)0x0) << TIMER_CH_CNTRL0_CAP_NPWM_Pos), /*!< Specify the PWM channel mode. */
    TIMER_CH_MODE_CAPTURE = (((uint32_t)0x1) << TIMER_CH_CNTRL0_CAP_NPWM_Pos)  /*!< Specify the capture channel mode. */
} TIMER_CH_Mode_TypeDef;

#define IS_TIMER_CH_MODE(MODE) (((MODE) == TIMER_CH_MODE_PWM) || \
                                ((MODE) == TIMER_CH_MODE_CAPTURE))

/**
 * @brief TIMER channel REF format in PWM mode.
 */
typedef enum {
    TIMER_CH_PWM_REF_FORMAT_0 = TIMER_CH_CNTRL0_OCCM_FORMAT_0, /*!< REF = 0. */
    TIMER_CH_PWM_REF_FORMAT_1 = TIMER_CH_CNTRL0_OCCM_FORMAT_1, /*!< REF = 1 if: (CNT == CCR) or ((CNT == CCR1) and CCR1_EN = 1),
                                                                    else REF = 0. */
    TIMER_CH_PWM_REF_FORMAT_2 = TIMER_CH_CNTRL0_OCCM_FORMAT_2, /*!< REF = 0 if: (CNT == CCR) or ((CNT == CCR1) and CCR1_EN = 1),
                                                                    else REF = 1. */
    TIMER_CH_PWM_REF_FORMAT_3 = TIMER_CH_CNTRL0_OCCM_FORMAT_3, /*!< Toggle REF state if: (CNT == CCR) or
                                                                                        ((CNT == CCR1) and CCR1_EN = 1). */
    TIMER_CH_PWM_REF_FORMAT_4 = TIMER_CH_CNTRL0_OCCM_FORMAT_4, /*!< REF = 0. */
    TIMER_CH_PWM_REF_FORMAT_5 = TIMER_CH_CNTRL0_OCCM_FORMAT_5, /*!< REF = 1. */
    TIMER_CH_PWM_REF_FORMAT_6 = TIMER_CH_CNTRL0_OCCM_FORMAT_6, /*!< If CCR1_EN = 0:
                                                                      DIR = 0: REF = 1 if (CNT < CCR), else REF = 0,
                                                                      DIR = 1: REF = 0 if (CNT > CCR), else REF = 1,
                                                                    else if CCR1_EN = 1:
                                                                      DIR = 0: REF = 0 if (CCR <= CNT <= CCR1), else REF = 1,
                                                                      DIR = 1: REF = 0 if (CCR < CNT < CCR1), else REF = 1.
                                                                    The condition (CCR < CCR1) must be observed. */
    TIMER_CH_PWM_REF_FORMAT_7 = TIMER_CH_CNTRL0_OCCM_FORMAT_7  /*!< If CCR1_EN = 0:
                                                                       DIR = 0: REF = 0 if (CNT < CCR), else REF = 1,
                                                                       DIR = 1: REF = 1 if (CNT > CCR), else REF = 0,
                                                                    else if CCR1_EN = 1:
                                                                       DIR = 0: REF = 1 if (CCR <= CNT <= CCR1), else REF = 0,
                                                                       DIR = 1: REF = 1 if (CCR < CNT < CCR1), else REF = 0.
                                                                    The condition (CCR < CCR1) must be observed. */
} TIMER_CH_PWM_REF_Format_TypeDef;

#define IS_TIMER_CH_PWM_REF_FORMAT(FORMAT) (((FORMAT) == TIMER_CH_PWM_REF_FORMAT_0) || \
                                            ((FORMAT) == TIMER_CH_PWM_REF_FORMAT_1) || \
                                            ((FORMAT) == TIMER_CH_PWM_REF_FORMAT_2) || \
                                            ((FORMAT) == TIMER_CH_PWM_REF_FORMAT_3) || \
                                            ((FORMAT) == TIMER_CH_PWM_REF_FORMAT_4) || \
                                            ((FORMAT) == TIMER_CH_PWM_REF_FORMAT_5) || \
                                            ((FORMAT) == TIMER_CH_PWM_REF_FORMAT_6) || \
                                            ((FORMAT) == TIMER_CH_PWM_REF_FORMAT_7))

/**
 * @brief TIMER CCR and CCR1 update mode in PWM mode.
 */
typedef enum {
    TIMER_CH_PWM_CCR_UPD_IMMEDIATELY = (((uint32_t)0x0) << TIMER_CH_CNTRL2_CCR_RLD_Pos), /*!< The CCR and CCR1 registers is updated immediately. */
    TIMER_CH_PWM_CCR_UPD_ON_CNT_EQ_0 = (((uint32_t)0x1) << TIMER_CH_CNTRL2_CCR_RLD_Pos)  /*!< The CCR and CCR1 registers is updated at (CNT == 0) condition. */
} TIMER_CH_PWM_CCR_UpdateMode_TypeDef;

