piborisovich/microcontrollers/Milandr/Libraries/SPL/MDR32VF0xI/inc/MDR32VF0xI_timer.h
#define IS_TIMER_CH_OUTN_MODE(MODE) (((MODE) == TIMER_CH_OUTN_MODE_IN) ||        \
                                     ((MODE) == TIMER_CH_OUTN_MODE_OUT) ||       \
                                     ((MODE) == TIMER_CH_OUTN_MODE_REF_AS_OE) || \
                                     ((MODE) == TIMER_CH_OUTN_MODE_DTG_AS_OE))

/**
 * @brief TIMER status flags.
 */
typedef enum {
    TIMER_FLAG_CNT_ZERO     = TIMER_STATUS_CNT_ZERO_EVNT,     /*!< The (CNT == 0) condition occurred. */
    TIMER_FLAG_CNT_ARR      = TIMER_STATUS_CNT_ARR_EVNT,      /*!< The (CNT == ARR) condition occurred. */
    TIMER_FLAG_ETR_RE       = TIMER_STATUS_ETR_RE_EVNT,       /*!< The ETR rising edge occurred. */
    TIMER_FLAG_ETR_FE       = TIMER_STATUS_ETR_FE_EVNT,       /*!< The ETR falling edge occurred. */
    TIMER_FLAG_BRK          = TIMER_STATUS_BRK_EVNT,          /*!< The (BRK == 1) condition occurred. */
    TIMER_FLAG_CH1_CAP_CCR  = TIMER_STATUS_CCR_CAP_EVNT_CH1,  /*!< The Channel 1 CCR capture condition occurred. */
    TIMER_FLAG_CH2_CAP_CCR  = TIMER_STATUS_CCR_CAP_EVNT_CH2,  /*!< The Channel 2 CCR capture condition occurred. */
    TIMER_FLAG_CH3_CAP_CCR  = TIMER_STATUS_CCR_CAP_EVNT_CH3,  /*!< The Channel 3 CCR capture condition occurred. */
    TIMER_FLAG_CH4_CAP_CCR  = TIMER_STATUS_CCR_CAP_EVNT_CH4,  /*!< The Channel 4 CCR capture condition occurred. */
    TIMER_FLAG_CH1_PWM_REF  = TIMER_STATUS_CCR_REF_EVNT_CH1,  /*!< The Channel 1 (REF == 1) condition occurred. */
    TIMER_FLAG_CH2_PWM_REF  = TIMER_STATUS_CCR_REF_EVNT_CH2,  /*!< The Channel 2 (REF == 1) condition occurred. */
    TIMER_FLAG_CH3_PWM_REF  = TIMER_STATUS_CCR_REF_EVNT_CH3,  /*!< The Channel 3 (REF == 1) condition occurred. */
    TIMER_FLAG_CH4_PWM_REF  = TIMER_STATUS_CCR_REF_EVNT_CH4,  /*!< The Channel 4 (REF == 1) condition occurred. */
    TIMER_FLAG_CH1_CAP_CCR1 = TIMER_STATUS_CCR_CAP1_EVNT_CH1, /*!< The Channel 1 CCR1 capture condition occurred. */
    TIMER_FLAG_CH2_CAP_CCR1 = TIMER_STATUS_CCR_CAP1_EVNT_CH2, /*!< The Channel 2 CCR1 capture condition occurred. */
    TIMER_FLAG_CH3_CAP_CCR1 = TIMER_STATUS_CCR_CAP1_EVNT_CH3, /*!< The Channel 3 CCR1 capture condition occurred. */
    TIMER_FLAG_CH4_CAP_CCR1 = TIMER_STATUS_CCR_CAP1_EVNT_CH4  /*!< The Channel 4 CCR1 capture condition occurred. */
} TIMER_Flags_TypeDef;

#define TIMER_FLAG_MASK (TIMER_FLAG_CNT_ZERO |     \
                         TIMER_FLAG_CNT_ARR |      \
                         TIMER_FLAG_ETR_RE |       \
                         TIMER_FLAG_ETR_FE |       \
                         TIMER_FLAG_BRK |          \
                         TIMER_FLAG_CH1_CAP_CCR |  \
                         TIMER_FLAG_CH2_CAP_CCR |  \
                         TIMER_FLAG_CH3_CAP_CCR |  \
                         TIMER_FLAG_CH4_CAP_CCR |  \
                         TIMER_FLAG_CH1_PWM_REF |  \
                         TIMER_FLAG_CH2_PWM_REF |  \
                         TIMER_FLAG_CH3_PWM_REF |  \
                         TIMER_FLAG_CH4_PWM_REF |  \
                         TIMER_FLAG_CH1_CAP_CCR1 | \
                         TIMER_FLAG_CH2_CAP_CCR1 | \
                         TIMER_FLAG_CH3_CAP_CCR1 | \
                         TIMER_FLAG_CH4_CAP_CCR1)

#define IS_TIMER_FLAG(FLAG) (((FLAG) == TIMER_FLAG_CNT_ZERO) ||     \
                             ((FLAG) == TIMER_FLAG_CNT_ARR) ||      \
                             ((FLAG) == TIMER_FLAG_ETR_RE) ||       \
                             ((FLAG) == TIMER_FLAG_ETR_FE) ||       \
                             ((FLAG) == TIMER_FLAG_BRK) ||          \
                             ((FLAG) == TIMER_FLAG_CH1_CAP_CCR) ||  \
                             ((FLAG) == TIMER_FLAG_CH2_CAP_CCR) ||  \
                             ((FLAG) == TIMER_FLAG_CH3_CAP_CCR) ||  \
                             ((FLAG) == TIMER_FLAG_CH4_CAP_CCR) ||  \
                             ((FLAG) == TIMER_FLAG_CH1_PWM_REF) ||  \
                             ((FLAG) == TIMER_FLAG_CH2_PWM_REF) ||  \
                             ((FLAG) == TIMER_FLAG_CH3_PWM_REF) ||  \
                             ((FLAG) == TIMER_FLAG_CH4_PWM_REF) ||  \
                             ((FLAG) == TIMER_FLAG_CH1_CAP_CCR1) || \
                             ((FLAG) == TIMER_FLAG_CH2_CAP_CCR1) || \
                             ((FLAG) == TIMER_FLAG_CH3_CAP_CCR1) || \
                             ((FLAG) == TIMER_FLAG_CH4_CAP_CCR1))

#define IS_TIMER_FLAGS(FLAGS) (((FLAGS) & ~((uint32_t)TIMER_FLAG_MASK)) == 0)

/**
 * @brief TIMER counter init structure definition.
 */
typedef struct {
    uint32_t TIMER_CNT_Counter;                                    /*!< Specify the initial counter value.
                                                                        This parameter can be a number from 0x00000000 to 0xFFFFFFFF. */
    uint32_t TIMER_CNT_Prescaler;                                  /*!< Specify the prescaler value used to divide the TIM_CLK.
                                                                        This parameter can be a number from 0x00000000 to 0xFFFFFFFF.
                                                                        TIM_CLKd = TIM_CLK/(TIMER_CNT_Prescaler + 1). */
    uint32_t TIMER_CNT_Period;                                     /*!< Specify the counter period that will be loaded into the ARR register at the next update event.
                                                                        The full counter period is TIMER_CNT_Period + 1.
                                                                        This parameter must be a number from 0x00000000 to 0xFFFFFFFF. */
    TIMER_CNT_EventSource_TypeDef TIMER_CNT_EventSource;           /*!< Specify the counter event source.
                                                                        This parameter can be a value of @ref TIMER_CNT_EventSource_TypeDef. */
    TIMER_CNT_Mode_TypeDef TIMER_CNT_Mode;                         /*!< Specify the counter mode.
                                                                        This parameter can be a value of @ref TIMER_CNT_Mode_TypeDef.
                                                                        Note: TIMER_CNT_Mode use with TIMER_CNT_EventSource!
                                                                              If TIMER_CNT_EventSource != TIMER_CNT_EVNT_SRC_TIM_CLK, then TIMER_CNT_Mode = TIMER_CNT_MODE_EVNT_FIXED_DIR. */
    TIMER_CNT_Dir_TypeDef TIMER_CNT_Direction;                     /*!< Specify the counter direction.
                                                                        This parameter can be a value of @ref TIMER_CNT_Dir_TypeDef. */
    TIMER_CNT_PeriodUpdateMode_TypeDef TIMER_CNT_PeriodUpdateMode; /*!< Specify the counter period (ARR register) updating mode.
                                                                        This parameter can be a value of @ref TIMER_CNT_PeriodUpdateMode_TypeDef. */
    TIMER_FDTS_Prescaler_TypeDef TIMER_FDTS_Prescaler;             /*!< Specify the FDTS prescaler configuration.
                                                                        This parameter can be a value of @ref TIMER_FDTS_Prescaler_TypeDef. */
    TIMER_ETR_Filter_TypeDef TIMER_ETR_Filter;                     /*!< Specify the ETR filter configuration.
                                                                        This parameter can be a value of @ref TIMER_ETR_Filter_TypeDef. */
    TIMER_ETR_Prescaler_TypeDef TIMER_ETR_Prescaler;               /*!< Specify the ETR prescaler configuration.
                                                                        This parameter can be a value of @ref TIMER_ETR_Prescaler_TypeDef. */
    TIMER_ETR_Polarity_TypeDef TIMER_ETR_Polarity;                 /*!< Specify the ETR polarity configuration.
                                                                        This parameter can be a value of @ref TIMER_ETR_Polarity_TypeDef. */
    TIMER_BRK_Polarity_TypeDef TIMER_BRK_Polarity;                 /*!< Specify the BRK polarity configuration.
                                                                        This parameter can be a value of @ref TIMER_BRK_Polarity_TypeDef. */
} TIMER_CNT_InitTypeDef;

/**
 * @brief TIMER channel init structure definition.
 */
typedef struct {
    TIMER_CH_Number_TypeDef TIMER_CH_Number; /*!< Specify the TIMER channel number to be configured.
                                                  This parameter can be a value of @ref TIMER_CH_Number_TypeDef. */
    TIMER_CH_Mode_TypeDef TIMER_CH_Mode;     /*!< Specify the TIMER channel mode.
                                                  This parameter can be a value of @ref TIMER_CH_Mode_TypeDef. */
    FunctionalState TIMER_CH_UseCCR1;        /*!< Enable or disable the CCR1 register.
                                                  This parameter can be a value of @ref FunctionalState. */

    TIMER_CH_PWM_REF_Format_TypeDef TIMER_CH_PWM_REF_Format;           /*!< Specify the REF signal format in PWM mode.
                                                                            This parameter can be a value of @ref TIMER_CH_PWM_REF_Format_TypeDef. */
    TIMER_CH_PWM_CCR_UpdateMode_TypeDef TIMER_CH_PWM_CCR_UpdateMode;   /*!< Specify the TIMER CCR, CCR1 update mode in PWM mode.
                                                                            This parameter can be a value of @ref TIMER_CH_PWM_CCR_UpdateMode_TypeDef. */
    TIMER_CH_PWM_DTG_ClockSource_TypeDef TIMER_CH_PWM_DTG_ClockSource; /*!< Specify the TIMER DTG clock source in PWM mode.
                                                                            This parameter can be a value of @ref TIMER_CH_PWM_DTG_ClockSource_TypeDef. */
    uint8_t TIMER_CH_PWM_DTG_MainPrescaler;                            /*!< Specify the main prescaler of TIMER DTG in PWM mode.
                                                                            This parameter can be a number from 0x00 to 0xFF. */
    uint8_t TIMER_CH_PWM_DTG_AuxPrescaler;                             /*!< Specify the auxiliary prescaler of TIMER DTG in PWM mode.
                                                                            This parameter can be a number from 0x00 to 0x0F.
                                                                            Delay DTGdel = TIMER_CH_PWM_DTG_MainPrescaler*(TIMER_CH_PWM_DTG_AuxPrescaler + 1) clocks. */
    FunctionalState TIMER_CH_PWM_ETR_UseReset;                         /*!< Use REF reset by ETR (active high) in PWM mode.
                                                                            This parameter can be a value of @ref FunctionalState. */
    FunctionalState TIMER_CH_PWM_BRK_UseReset;                         /*!< Use REF and DTG reset by BRK (active low) in PWM mode.
                                                                            This parameter can be a value of @ref FunctionalState. */

    TIMER_CH_CAP_CCR_EventSource_TypeDef TIMER_CH_CAP_CCR_EventSource;   /*!< Specify the channel CCR event source in capture mode.
                                                                              This parameter can be a value of @ref TIMER_CH_CAP_CCR_EventSource_TypeDef. */
    TIMER_CH_CAP_CCR1_EventSource_TypeDef TIMER_CH_CAP_CCR1_EventSource; /*!< Specify the channel CCR1 event source in capture mode.
                                                                              This parameter can be a value of @ref TIMER_CH_CAP_CCR1_EventSource_TypeDef. */
    TIMER_CH_CAP_EventPrescaler_TypeDef TIMER_CH_CAP_EventPrescaler;     /*!< Specify the TIMER channel events prescaler configuration in capture mode.
                                                                              This parameter can be a value of @ref TIMER_CH_CAP_EventPrescaler_TypeDef. */
    FunctionalState TIMER_CH_CAP_UseEventDelay;                          /*!< Use synchronization between the capture event and the update of registers CCR and CCR1.
                                                                              This parameter can be a value of @ref FunctionalState. */
    TIMER_CH_Filter_TypeDef TIMER_CH_CAP_Filter;                         /*!< Specify the TIMER channel filter configuration.
                                                                              This parameter can be a value of @ref TIMER_CH_Filter_TypeDef. */
} TIMER_CH_InitTypeDef;

/**
 * @brief TIMER channel output init structure definition.
 */
typedef struct {
    TIMER_CH_Number_TypeDef TIMER_CH_Number; /*!< Specify the TIMER channel number to be configured.
                                                  This parameter can be a value of @ref TIMER_CH_Number_TypeDef. */

