piborisovich/microcontrollers/Milandr/Libraries/SPL/MDR32VF0xI/inc/MDR32VF0xI_timer.h
    TIMER_CH_OUTP_Polarity_TypeDef TIMER_CH_OUTP_Polarity; /*!< Specify the TIMER CHy output polarity.
                                                                This parameter can be a value of @ref TIMER_CH_OUTP_Polarity_TypeDef. */
    TIMER_CH_OUTP_Source_TypeDef TIMER_CH_OUTP_Source;     /*!< Specify the TIMER CHy output source.
                                                                This parameter can be a value of @ref TIMER_CH_OUTP_Source_TypeDef. */
    TIMER_CH_OUTP_Mode_TypeDef TIMER_CH_OUTP_Mode;         /*!< Specify the TIMER CHy output enable source.
                                                                This parameter can be a value of @ref TIMER_CH_OUTP_Mode_TypeDef. */

    TIMER_CH_OUTN_Polarity_TypeDef TIMER_CH_OUTN_Polarity; /*!< Enable or disable the TIMER nCHy output inversion.
                                                                This parameter can be a value of @ref TIMER_CH_OUTN_Polarity_TypeDef. */
    TIMER_CH_OUTN_Source_TypeDef TIMER_CH_OUTN_Source;     /*!< Specify the TIMER nCHy output source.
                                                                This parameter can be a value of @ref TIMER_CH_OUTN_Source_TypeDef. */
    TIMER_CH_OUTN_Mode_TypeDef TIMER_CH_OUTN_Mode;         /*!< Specify the TIMER nCHy output enable source.
                                                                This parameter can be a value of @ref TIMER_CH_OUTN_Mode_TypeDef. */
} TIMER_CH_OUT_InitTypeDef;

/** @} */ /* End of the group TIMER_Exported_Types */

/** @defgroup TIMER_Exported_Defines TIMER Exported Defines
 * @{
 */

/** @defgroup TIMER_CH_PWM_DTG_Prescaler TIMER Channel PWM DTG Prescaler
 * @{
 */

#define IS_TIMER_CH_PWM_DTG_AUX_PRESCALER(VALUE) (((VALUE) & ~TIMER_CH_DTG_DTGX_Msk) == 0)

/** @} */ /* End of the group TIMER_CH_PWM_DTG_Prescaler */

/** @} */ /* End of the group TIMER_Exported_Defines */

/** @addtogroup TIMER_Exported_Functions TIMER Exported Functions
 * @{
 */

void TIMER_DeInit(MDR_TIMER_TypeDef* TIMERx);

void TIMER_CNT_Init(MDR_TIMER_TypeDef* TIMERx, const TIMER_CNT_InitTypeDef* TIMER_CntInitStruct);
void TIMER_CNT_StructInit(TIMER_CNT_InitTypeDef* TIMER_CntInitStruct);

void            TIMER_CNT_Cmd(MDR_TIMER_TypeDef* TIMERx, FunctionalState NewState);
FunctionalState TIMER_CNT_GetCmdState(MDR_TIMER_TypeDef* TIMERx);

void     TIMER_CNT_SetCounter(MDR_TIMER_TypeDef* TIMERx, uint32_t Counter);
uint32_t TIMER_CNT_GetCounter(MDR_TIMER_TypeDef* TIMERx);

void     TIMER_CNT_SetPrescaler(MDR_TIMER_TypeDef* TIMERx, uint32_t Prescaler);
uint32_t TIMER_CNT_GetPrescaler(MDR_TIMER_TypeDef* TIMERx);

void     TIMER_CNT_SetPeriodUpdateMode(MDR_TIMER_TypeDef* TIMERx, TIMER_CNT_PeriodUpdateMode_TypeDef PeriodUpdateMode);
void     TIMER_CNT_SetPeriod(MDR_TIMER_TypeDef* TIMERx, uint32_t Period);
uint32_t TIMER_CNT_GetPeriod(MDR_TIMER_TypeDef* TIMERx);

void                  TIMER_CNT_EventSourceConfig(MDR_TIMER_TypeDef* TIMERx, TIMER_CNT_EventSource_TypeDef EventSource);
void                  TIMER_CNT_ModeConfig(MDR_TIMER_TypeDef* TIMERx, TIMER_CNT_Mode_TypeDef Mode);
void                  TIMER_CNT_SetDirection(MDR_TIMER_TypeDef* TIMERx, TIMER_CNT_Dir_TypeDef Direction);
TIMER_CNT_Dir_TypeDef TIMER_CNT_GetDirection(MDR_TIMER_TypeDef* TIMERx);
FlagStatus            TIMER_CNT_GetWriteStatus(MDR_TIMER_TypeDef* TIMERx);

void TIMER_FDTS_SetPrescaler(MDR_TIMER_TypeDef* TIMERx, TIMER_FDTS_Prescaler_TypeDef Prescaler);

void TIMER_ETR_InputConfig(MDR_TIMER_TypeDef* TIMERx, TIMER_ETR_Prescaler_TypeDef Prescaler, TIMER_ETR_Polarity_TypeDef Polarity, TIMER_ETR_Filter_TypeDef Filter);
void TIMER_ETR_FilterConfig(MDR_TIMER_TypeDef* TIMERx, TIMER_ETR_Filter_TypeDef Filter);
void TIMER_ETR_PrescalerConfig(MDR_TIMER_TypeDef* TIMERx, TIMER_ETR_Prescaler_TypeDef Prescaler);
void TIMER_ETR_PolarityConfig(MDR_TIMER_TypeDef* TIMERx, TIMER_ETR_Polarity_TypeDef Polarity);
void TIMER_BRK_PolarityConfig(MDR_TIMER_TypeDef* TIMERx, TIMER_BRK_Polarity_TypeDef Polarity);
void TIMER_CH_FilterConfig(MDR_TIMER_TypeDef* TIMERx, TIMER_CH_Number_TypeDef Channel, TIMER_CH_Filter_TypeDef Filter);

void TIMER_CH_Init(MDR_TIMER_TypeDef* TIMERx, const TIMER_CH_InitTypeDef* TIMER_ChInitStruct);
void TIMER_CH_StructInit(TIMER_CH_InitTypeDef* TIMER_ChInitStruct);

void       TIMER_CH_SetCCR(MDR_TIMER_TypeDef* TIMERx, TIMER_CH_Number_TypeDef Channel, uint32_t CCR);
uint32_t   TIMER_CH_GetCCR(MDR_TIMER_TypeDef* TIMERx, TIMER_CH_Number_TypeDef Channel);
FlagStatus TIMER_CH_GetCCRWriteStatus(MDR_TIMER_TypeDef* TIMERx, TIMER_CH_Number_TypeDef Channel);

void            TIMER_CH_CCR1Cmd(MDR_TIMER_TypeDef* TIMERx, TIMER_CH_Number_TypeDef Channel, FunctionalState NewState);
FunctionalState TIMER_CH_GetCCR1CmdState(MDR_TIMER_TypeDef* TIMERx, TIMER_CH_Number_TypeDef Channel);
void            TIMER_CH_SetCCR1(MDR_TIMER_TypeDef* TIMERx, TIMER_CH_Number_TypeDef Channel, uint32_t CCR1);
uint32_t        TIMER_CH_GetCCR1(MDR_TIMER_TypeDef* TIMERx, TIMER_CH_Number_TypeDef Channel);
FlagStatus      TIMER_CH_GetCCR1WriteStatus(MDR_TIMER_TypeDef* TIMERx, TIMER_CH_Number_TypeDef Channel);

void TIMER_CH_PWM_SetCompareUpdateMode(MDR_TIMER_TypeDef* TIMERx, TIMER_CH_Number_TypeDef Channel, TIMER_CH_PWM_CCR_UpdateMode_TypeDef UpdateMode);
/**
 * @brief  Set the TIMERx channel capture/compare register (CCR) value.
 * @param  TIMERx: Select the TIMER peripheral.
 *         This parameter can be one of the MDR_TIMERx values, where x is a number in range [1; 4].
 * @param  Channel: @ref TIMER_CH_Number_TypeDef - specify the TIMERx channel number.
 * @param  Compare: Specify the capture/compare register (CCR) new value.
 * @return None.
 */
#define TIMER_CH_PWM_SetCompare(TIMERx, Channel, Compare) TIMER_CH_SetCCR(TIMERx, Channel, Compare)

/**
 * @brief  Set the TIMERx channel capture/compare register 1 (CCR1) value.
 * @param  TIMERx: Select the TIMER peripheral.
 *         This parameter can be one of the MDR_TIMERx values, where x is a number in range [1; 4].
 * @param  Channel: @ref TIMER_CH_Number_TypeDef - specify the TIMERx channel number.
 * @param  Compare1: Specify the capture/compare register 1 (CCR1) new value.
 * @return None.
 */
#define TIMER_CH_PWM_SetCompare1(TIMERx, Channel, Compare1) TIMER_CH_SetCCR1(TIMERx, Channel, Compare1)

